Repository: Mad-Pixels/applingo-ios
Catalog: applingo/Resources/Localizable.xcstrings
Source language: en
Languages: ru

# base.button.again
source: try again
ru: еще раз

# base.button.close
source: close
ru: закрыть

# base.button.delete
source: delete
ru: удалить

# base.button.download
source: Download
ru: Загрузить

# base.button.reset
source: reset
ru: сбросить

# base.button.save
source: save
ru: сохранить

# base.text.noItems
source: No items found
ru: Ничего не найдено

# base.text.search
source: Search
ru: Поиск

# component.GameTab.description.score
source: score
ru: очки

# component.GameTab.description.streak
source: streak
ru: комбо

# error.api.apiErrorMessage
source: An error occurred while processing the API request. Please try again later.
ru: Произошла ошибка при обработке запроса к API. Пожалуйста, попробуйте позже.

# error.api.baseURLNotConfigured
source: The API base URL is not configured. Please reinstall the application!
ru: Базовый URL API не настроен. Пожалуйста, переустановите приложение!

# error.api.httpError
source: A network error occurred. Please check your connection and try again.
ru: Произошла ошибка сети. Пожалуйста, проверьте подключение и повторите попытку.

# error.api.invalidAPIResponse
source: The API response is invalid. Please try again later.
ru: Ответ API недействителен. Пожалуйста, попробуйте позже.

# error.api.invalidBaseURL
source: The provided base URL is invalid. Please reinstall the application!
ru: Указанный базовый URL недействителен. Пожалуйста, переустановите приложение!

# error.api.invalidEndpointURL
source: The provided endpoint URL is invalid. Please reinstall the application!
ru: Указанный URL конечной точки недействителен. Пожалуйста, переустановите приложение!

# error.api.s3Error
source: An error occurred while accessing the server. Please try again later.
ru: Произошла ошибка при обращении к серверу. Пожалуйста, попробуйте позже.

# error.api.title
source: Request processing error
ru: Ошибка обработки запроса

# error.database.alreadyConnected
source: The database is already connected.
ru: База данных уже подключена.

# error.database.connectionFailed
source: Failed to connect to the database. Please reinstall the application!
ru: Не удалось подключиться к базе данных. Переустановите приложение!

# error.database.connectionNotEstablished
source: The database connection is not established. Please reinstall the application.
ru: Подключение к базе данных не установлено. Переустановите приложение!

# error.database.deleteFailed
source: Failed to delete the data. Please try again.
ru: Не удалось удалить данные. Пожалуйста, попробуйте снова.

# error.database.duplicateDictionary
source: This dictionary already exist!
ru: Этот словарь уже существует!

# error.database.duplicateWord
source: This word already exists!
ru: Это слово уже существует!

# error.database.emptyActiveDictionaries
source: No active dictionaries found. Please add a dictionary and try again.
ru: Активные словари не найдены. Пожалуйста, добавьте словарь и попробуйте снова.

# error.database.fileImportFailed
source: Failed to import dictionary. Please check the file and try again.
ru: Не удалось импортировать словарь. Пожалуйста, проверьте файл и попробуйте снова.

# error.database.internalDictionaryDelete
source: Internal dictionary cannot be deleted.
ru: Нельзя удалить системный словарь

# error.database.invalidLimit
source: Invalid limit value. Please try again.
ru: Недопустимое значение лимита. Пожалуйста, попробуйте снова.

# error.database.invalidOffset
source: Invalid offset value. Please try again.
ru: Недопустимое значение смещения. Пожалуйста, попробуйте снова.

# error.database.invalidSearchParameters
source: Invalid search parameters. Please try again.
ru: Недопустимые параметры поиска. Пожалуйста, попробуйте снова.

# error.database.invalidWord
source: The word data is invalid. Please check the input and try again.
ru: Данные слова недействительны. Пожалуйста, проверьте ввод и попробуйте снова.

# error.database.migrationFailed
source: Database migration failed. Please reinstall the application!
ru: Ошибка миграции базы данных. Пожалуйста, переустановите приложение!

# error.database.saveFailed
source: Failed to save data. Please try again.
ru: Не удалось сохранить данные. Пожалуйста, попробуйте снова.

# error.database.selectDataFailed
source: Failed to retrieve data. Please try again.
ru: Не удалось получить данные. Пожалуйста, попробуйте снова.

# error.database.title
source: Database Error
ru: Ошибка базы данных

# error.database.updateFailed
source: Failed to update the data. Please try again.
ru: Не удалось обновить данные. Пожалуйста, попробуйте снова.

# error.database.wordNotFound
source: The requested word was not found.
ru: Запрашиваемое слово не найдено.

# error.parser.emptyFile
source: The file is empty. Please provide a valid file.
ru: Файл пуст. Укажите корректный файл.

# error.parser.fileReadFailed
source: Failed to open the file.
ru: Не удалось открыть файл.

# error.parser.invalidFormat
source: Invalid file format. Please use a supported format.
ru: Недопустимый формат файла. Используйте поддерживаемый формат.

# error.parser.notEnoughColumns
source: The file must contain at least two columns (text, definition).
ru: Файл должен содержать минимум две колонки (текст, перевод).

# error.parser.parsingFailed
source: Failed to process the file. The format may be incorrect.
ru: Не удалось обработать файл. Возможно, неверный формат.

# error.parser.title
source: Import Error
ru: Ошибка импорта

# error.parser.unsupportedFormat
source: This file format is not supported.
ru: Этот формат файла не поддерживается.

# error.tts.audioSessionError
source: audio session error
ru: ошибка запуска драйвера

# error.tts.emptyText
source: empty text
ru: пустой текст

# error.tts.invalidLanguageCode
source: invalid language code
ru: неверный языковой код

# error.tts.title
source: Text to speech error
ru: Ошибка TTS

# error.tts.voiceNotFound
source: voice not found
ru: модель не найдена

# game.result.noLives
source: Game Over!
ru: Игра закончена!

# game.result.stats.accuracy
source: Accuracy
ru: Точность

# game.result.stats.averageTime
source: Average Time
ru: Время ответов

# game.result.stats.bestStreak
source: Best Streak
ru: Лучшая серия

# game.result.stats.secText
source: sec
ru: сек

# game.result.stats.totalAnswers
source: Total Answers
ru: Ответов всего

# game.result.stats.totalScore
source: Scores
ru: Очки

# game.result.timeUp
source: Time Up!
ru: Время вышло!

# screen.dictionaryImport.description.BlockA
source: Word/Phrase
ru: Слово/Фраза

# screen.dictionaryImport.description.BlockB
source: Definition
ru: Перевод

# screen.dictionaryImport.description.BlockC
source: Hint
ru: Подсказка

# screen.dictionaryImport.description.BlockD
source: Description
ru: Описание

# screen.dictionaryImport.subtitle.ctreateTable
source: Table overview
ru: Создание таблицы

# screen.dictionaryImport.subtitle.dictionaryAdd
source: Dictionary add
ru: Добавить словарь

# screen.dictionaryImport.tag.optional
source: optional
ru: опционально

# screen.dictionaryImport.tag.required
source: required
ru: обязательно

# screen.dictionaryImport.text.dictionaryAdd
source: To add a dictionary, you must upload a file containing words in a table format, such as Excel or CSV
ru: Чтобы добавить словарь, необходимо загрузить файл со словами в табличном формате, например, Excel или CSV

# screen.dictionaryImport.text.note
source: The table should not include column headers
ru: В таблице не должно быть названий колонок

# screen.dictionaryImport.title
source: Import
ru: Импорт

# screen.dictionaryLocalDetails.description.author
source: Author
ru: Автор

# screen.dictionaryLocalDetails.description.createdAt
source: Download date
ru: Дата загрузки

# screen.dictionaryLocalDetails.description.description
source: Overview
ru: Детализация

# screen.dictionaryLocalDetails.description.name
source: Name
ru: Имя

# screen.dictionaryLocalDetails.description.subcategory
source: Group
ru: Группа

# screen.dictionaryLocalDetails.title
source: Dictionary
ru: Словарь

# screen.dictionaryLocalList.title
source: Dictionaries
ru: Словари

# screen.dictionaryRemoteDetails.subtitle.additional
source: Additional
ru: Дополнительно

# screen.dictionaryRemoteDetails.subtitle.category
source: Category
ru: Категория

# screen.dictionaryRemoteDetails.subtitle.dictionary
source: Description
ru: Описание

# screen.dictionaryRemoteDetails.subtitle.dictionaryExist
source: Already downloaded
ru: Уже добавлено

# screen.dictionaryRemoteDetails.title
source: Dictionary
ru: Словарь

# screen.dictionaryRemoteFilter.subtitle.language
source: Language pair
ru: Языковая пара

# screen.dictionaryRemoteFilter.subtitle.level
source: Words level
ru: Уровень слов

# screen.dictionaryRemoteFilter.subtitle.sortBy
source: Sort By
ru: Сортировка

# screen.dictionaryRemoteFilter.text.advancedLevel
source: Advanced
ru: Продвинутый

# screen.dictionaryRemoteFilter.text.beginnerLevel
source: Beginner
ru: Начальный

# screen.dictionaryRemoteFilter.text.elementaryLevel
source: Elementary
ru: Элементарный

# screen.dictionaryRemoteFilter.text.intermediateLevel
source: Intermediate
ru: Средний

# screen.dictionaryRemoteFilter.text.proficientLevel
source: Proficient
ru: Свободное владение

# screen.dictionaryRemoteFilter.text.UFOLevel
source: Any
ru: Любой

# screen.dictionaryRemoteFilter.text.upperIntermediateLevel
source: Upper-Intermediate
ru: Выше среднего

# screen.dictionaryRemoteFilter.title
source: Filter
ru: Фильтр

# screen.dictionaryRemoteList.title
source: Download dictionaries
ru: Скачать словари

# screen.gameMode.description.practice
source: Game without limits
ru: Игра без ограничений

# screen.gameMode.description.survival
source: Limited lives
ru: Лимит на жизни

# screen.gameMode.description.time
source: Time Challenge
ru: Игра на время

# screen.gameMode.subtitle.practice
source: Practice
ru: Практика

# screen.gameMode.subtitle.survival
source: Survival
ru: Выживание

# screen.gameMode.subtitle.time
source: Time
ru: На время

# screen.gameMode.title
source: Select game mode
ru: Режим игры

# screen.gameMode.titleSettings
source: Settings
ru: Настройки

# screen.gameSwipe.cardRight
source: right
ru: верно

# screen.gameSwipe.cardWrong
source: wrong
ru: не верно

# screen.home.game.matchup
source: matchup
ru: совпадение

# screen.home.game.quiz
source: quiz
ru: квиз

# screen.home.game.swipe
source: swipe
ru: свайп

# screen.noWords.addDictionariesChoice
source: or
ru: или

# screen.noWords.addDictionariesTitle
source: How to add a new dictionary?
ru: Как добавить новый словарь?

# screen.noWords.importOptionLocal
source: import from local device
ru: импортировать локальный словарь

# screen.noWords.importOptionRemote
source: remote dictionaries
ru: скачать словари

# screen.noWords.noWordsDescription
source: Dictionaries are not activated or missing, there are no active words.
ru: Словари не активированы или отсутствуют, нет активных слов.

# screen.noWords.subtitle
source: No active words
ru: Нет активных слов

# screen.noWords.tabDictionariesDescriptionImport
source: On the “dictionaries” tab, tap on the floating button and select:
ru: На вкладке “Словари” нажмите на плавающую кнопку и выберите:

# screen.noWords.tabWordsDescription
source: If you don’t have any dictionaries, you can switch to the “words” tab.
ru: Если у вас нет словарей, вы можете переключиться на вкладку “слова”.

# screen.noWords.tabWordsDescriptionActions
source: On this tab, you have two options:
ru: На этой вкладке можно:

# screen.profile.title
source: Profile
ru: Профиль

# screen.settings.description.asrPermission
source: To use voice-based answering in some games, please allow access to speech recognition.
ru: Чтобы использовать голосовые ответы в некоторых играх предоставьте доступ к Распознованию речи.

# screen.settings.description.feedback
source: Feedback
ru: Обратная связь

# screen.settings.description.microphonePermission
source: To use voice input, please allow microphone access.
ru: Для использования голосового ввода разрешите доступ к микрофону.

# screen.settings.settings.asrPermission
source: Settings > Privacy & Security > Speech Recognition
ru: Настройки > Конфиденциальность и безопасность > Распознавание речи

# screen.settings.settings.microphonePermission
source: Settings > Privacy & Security > Microphone
ru: Настройки > Конфиденциальность и безопасность > Микрофон

# screen.settings.subtitle.asrPermission
source: Speech Recognition Permission
ru: Доступ к распознаванию речи

# screen.settings.subtitle.feedback
source: Support Center
ru: Центр Поддержки

# screen.settings.subtitle.language
source: Language
ru: Язык

# screen.settings.subtitle.microphonePermission
source: Microphone Access
ru: Доступ к микрофону

# screen.settings.subtitle.theme
source: Theme
ru: Тема

# screen.settings.subtitle.theme.dark
source: Dark
ru: Темная

# screen.settings.subtitle.theme.light
source: Light
ru: Светлая

# screen.settings.title
source: Settings
ru: Настройки

# screen.settingsFeedback.button.about
source: About the application
ru: О приложении

# screen.settingsFeedback.button.report
source: Report a Bug
ru: Сообщить о проблеме

# screen.settingsFeedback.description.sendLogs
source: Send logs
ru: отправить логи

# screen.settingsFeedback.subtitle.sendLogs
source: Reports
ru: Отчеты

# screen.settingsFeedback.subtitle.urls
source: URLs
ru: Ссылки

# screen.settingsFeedback.text.sendLogs
source: Logs help us diagnose and fix issues faster. They contain only error reports and do not include any personal data.
ru: Логи помогают нам быстрее выявлять и исправлять ошибки. Они содержат только отчёты об ошибках и не включают персональные данные.

# screen.settingsFeedback.title
source: Feedback
ru: Обратная связь

# screen.wordAddManual.description.backText
source: Definition
ru: Перевод

# screen.wordAddManual.description.description
source: Overview
ru: Детализация

# screen.wordAddManual.description.frontText
source: Text
ru: Текст

# screen.wordAddManual.description.hint
source: Hint
ru: Подсказка

# screen.wordAddManual.subtitle.additional
source: Additional
ru: Дополнительно

# screen.wordAddManual.subtitle.word
source: Card
ru: Карточка

# screen.wordAddManual.title
source: New word
ru: Добавить слово

# screen.wordDetails.description.author
source: Author
ru: Автор

# screen.wordDetails.description.backText
source: Definition
ru: Перевод

# screen.wordDetails.description.correctAnswers
source: Correct
ru: Верно

# screen.wordDetails.description.createdAt
source: Download date
ru: Дата загрузки

# screen.wordDetails.description.description
source: Overview
ru: Детализация

# screen.wordDetails.description.dictionary
source: Dictionary
ru: Словарь

# screen.wordDetails.description.frontText
source: Text
ru: Текст

# screen.wordDetails.description.hint
source: Hint
ru: Подсказка

# screen.wordDetails.description.wrongAnswers
source: Wrong
ru: Ошибки

# screen.wordDetails.subtitle.additional
source: Additional
ru: Дополнительно

# screen.wordDetails.subtitle.noData
source: no data
ru: нет данных

# screen.wordDetails.subtitle.statistic
source: Statistics
ru: Статистика

# screen.wordDetails.subtitle.statistic.count
source: Answers
ru: Ответы

# screen.wordDetails.subtitle.word
source: Card
ru: Карточка

# screen.wordDetails.title
source: Word
ru: Слово

# screen.wordList.button.downloadDictionary
source: Download
ru: Скачать

# screen.wordList.button.downloadDictionaryDescription
source: Pre-made dictionaries
ru: Готовые словари

# screen.wordList.button.importDictionary
source: Import
ru: Импортировать

# screen.wordList.button.importDictionaryDescription
source: Local dictionary
ru: Локальный словарь

# screen.wordList.title
source: Words
ru: Слова

# settings.game.lives
source: Lives count
ru: Кол-во жизней

# settings.game.noVoice
source: Disable voice tasks
ru: Отключить голосовые задачи

# settings.game.timeDuration
source: Game duration
ru: Время игры

# sort.api.DictionarySortByDate
source: Date
ru: По дате

# sort.api.DictionarySortByRating
source: Rating
ru: По рейтингу

# tab.dictionary.title
source: Dictionaries
ru: Словари

# tab.general.title
source: Home
ru: Главная

# tab.profile.title
source: Profile
ru: Профиль

# tab.settings.title
source: Settings
ru: Настройки

# tab.word.title
source: Words
ru: Слова
